Repository: 84000/data-translation-memory
Catalog: toh431-v1.tmx
Source language: bo
Languages: en

source: ཡང་དག་པར་སྦྱོར་བ་ལས་ཉེ་བར་བྱུང་བའི་དཀར་དམར་ལོ་མའི་སྐྱོང་བུ་ལ་སོགས་པར་བཞག་ནས་སློབ་མ་བོས་ཏེ།
en: He should unite with her and place the semen and blood obtained from this in the fold of a leaf or such.

source: དེའི་ལྕེ་ལ་མཐེ་བོང་དང་མིང་མེད་ཀྱིས་རྫས་བཟུང་ནས། ཧཱུྃ་ཕཊ་ཀྱི་ཡི་གེ་བྲི་བར་བྱའོ། །
en: He should then summon the disciple. Using his ring finger and thumb, the teacher should take the substance and use it to write the syllables hūṁ and phaṭ on the disciple’s tongue.

source: དེ་ནས། ཨ་ཧོ་སུ་ཁྃ་ཞེས་བརྗོད་པར་བྱའོ། །
en: He should then ask the disciple to recite, ‘ Ah, pleasure.

source: དེ་ནས་འདི་བརྗོད་པར་བྱ་སྟེ།
en: “Then the teacher should say,

source: དེ་རིང་བདག་གིས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་བསྐྱེད་པར་བྱ་ཡིས།
en: ‘Today I will cause the buddha-knowledge to arise,

source: གང་གིས་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རབ་ཏུ་མི་གནས་པའི་མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་འགྱུར་གྱིས།
en: through which lord buddhas of the past, future, and present attain nonabiding nirvāṇa.

source: འོན་ཀྱང་ཁྱོད་ཀྱིས་དཀྱིལ་འཁོར་མ་མཐོང་བ་རྣམས་ཀྱི་མདུན་དུ་འདི་སྨྲ་བར་མི་བྱའོ། །
en: But you must not speak of this in front of anyone who has not seen the maṇḍala.

source: གལ་ཏེ་སྨྲས་ན་དེ་ཡི་ཚེ། །
en: If you do speak of it, then…’

source: དེ་ནས་སློབ་མའི་སྙིང་གར་རལ་གྲི་བཞག་ནས།
en: “Placing the sword against the disciple’s heart,

source: འདི་སྐད་བརྗོད་པར་བྱ་སྟེ།
en: the teacher should continue as follows:

source: ཤིན་ཏུ་རྣོ་བའི་རལ་གྲི་འདི། །ཁྲོ་བོ་གཏུམ་པོའི་ཕྱག་ན་གནས། །
en: “ ‘This sword, which is in Caṇḍa­mahā­roṣaṇa’s hand, Is very sharp indeed.

source: གང་གིས་དམ་ཚིག་འཇིག་བྱེད་པ། །
en: Whoever breaches the samaya,

source: དེ་ལ་འདི་ཡིས་མཆོག་ཏུ་གཅོད།
en: This sword is dedicated to cutting him up.

source: སྐྱེ་བ་བྱེ་བ་སྟོང་རྣམས་སུ།
en: “In billions of lives,

source: མི་རྣམས་རལ་གྲི་ལག་ཕྱར་བས། །
en: There will be people with swords in their hands,

source: ཡན་ལག་ཀུན་གཅོད་མགོ་བོ་ནི། །འདི་ཡིས་མཆོག་ཏུ་གཅོད་པར་བྱེད། །
en: Cutting off all his limbs, Eager to chop off his head—

source: དེ་ནས་སློབ་མས་བརྗོད་པར་བྱ་སྟེ།
en: Then the student should say:

source: དེ་ལྟར་ངེས་ཞེས་སོ།
en: ‘So be it.’

source: དཀྱིལ་འཁོར་དུ་མེ་ཏོག་དབུལ་བར་བྱའོ། །
en: invite him to throw a flower onto the maṇḍala.

source: དེ་ནས་གདོང་གཡོགས་བསལ་ནས།
en: As the teacher removes the blindfold,

source: དཀྱིལ་འཁོར་རབ་ཏུ་བསྟན་པར་བྱའོ། །
en: he should then point out the maṇḍala to the disciple

source: གང་དང་གང་གི་མཚན་མ་དེ་ནས་བསྟན་པར་བྱའོ། །
en: and explain its symbolism.

source: དེ་ནས་སློབ་མ་ལ་ཤེས་རབ་མ་དེ་སྦྱིན་པར་བྱའོ། །
en: Then he should offer the same wisdom consort to the disciple, saying:

source: གཟུངས་མ་ཡིད་འོང་འདི་ཁྱོད་ཀྱིས། །
en: “ ‘She is your delightful supporter;

source: བསྟེན་བྱར་སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས། །
en: She is to be served as taught by the buddhas.

source: རྨོངས་པ་གང་ཞིག་འདའ་བྱེད་པ། །
en: A fool who transgresses against this

source: དེ་ལ་མཆོག་གི་དངོས་གྲུབ་མེད། །
en: Will not attain the highest accomplishment.’

source: དེ་ནས་དགའ་བ་བཞིའི་རྣམ་པར་དབྱེ་བ་བླ་མས་རྣ་བར་སྨྲ་བར་བྱའོ། །
en: “Next the teacher should whisper into the disciple’s ear about the division of the four joys.

source: དེ་ནས་བླ་མ་ཕྱི་རོལ་དུ་བྱུང་ནས།
en: Then the teacher should go out.

source: ཤེས་རབ་གཅེར་བུར་ཅོག་པུས་གསང་གནས་མཛུབ་མོས་བསྟན་ནས།
en: The wisdom consort should undress and, lying on her back, point to her secret place,

source: ཅི་སྟེ་བུ་ཁྱོད་འདི་སྤྲོའམ། །
en: “ ‘My dear, are you eager

source: ང་ལས་མི་གཙང་བ་དང་ནི། །
en: To eat my impurities,

source: བཤང་གཅི་རཀྟ་ཟ་བ་དང་། །
en: Even if they were feces, urine, and blood,

source: བྷ་གའི་གནས་ལའོ་བྱེད་དམ། །
en: And suck the interior of my bhaga?’

source: སྒྲུབ་པ་པོས་སྨྲ་བར་བྱ་སྟེ།
en: “The sādhaka should say:

source: ཅི་ཡི་ཕྱིར་ན་བདག་མི་སྤྲོ། །
en: “ ‘Why wouldn’t I be eager,

source: ཁྱོད་ལས་མི་གཙང་བཟའ་བ་ནི། །
en: To eat your impurities?

source: བདག་གིས་མི་མོ་ཀུན་གུས་བྱ།
en: I should practice devotion to women

source: ཇི་སྲིད་བྱང་ཆུབ་སྙིང་པོའི་བར། །
en: Until I attain the essence of awakening.’

source: ཨ་ཧོ་བདག་གི་པདྨ་འདི། །བདེ་བ་ཐམས་ཅད་ཡང་དག་ལྡན། །གང་ཞིག་ཆོ་གས་སྟེན་བྱེད་ན། །
en: “And she should say: “ ‘Ah, whoever serves, According to procedure, this lotus of mine, Which is endowed with every pleasure,

source: བདག་ནི་དངོས་གྲུབ་སྩོལ་མཛད་མ། །
en: To him I will grant accomplishment.

source: པདྨ་ར་བྱ་བ་ཇི་བཞིན་གྱིས། །
en: “ ‘Do what needs to be done in the lotus,

source: བློ་ལྡན་བརྟན་པར་རབ་སྦྱོར་བས།
en: Steadily, applying forethought,

source: རང་ཉིད་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོར་གནས་པས་བདེ་བ་ཆེན་པོ་སྟེ།
en: For Caṇḍa­mahā­roṣaṇa himself Dwells here—the great bliss.’

source: དེ་ནས་སྒྲུབ་པ་པོ་བདག་ཉིད་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྣམ་པར་བསམས་ལ།
en: “Then the sādhaka, visualizing himself in the form of Caṇḍa­mahā­roṣaṇa and

source: ཤེས་རབ་ཀྱང་ཞེ་སྡང་རྡོ་རྗེ་མའི་ཚུལ་གྱིས་ཡང་དག་པར་སྦྱོར་བས།
en: visualizing the wisdom consort in the form of Hatred Vajrī, should make love and

source: དགའ་བ་བཞི་མཚོན་པར་བྱའོ།
en: note the four joys.

source: དེ་ནས་ཡོངས་སུ་རྫོགས་པ་དང་།
en: When this is completed,

source: བླ་མ་ལ་སོགས་པ་ལ་ཆང་དང་ཤ་ལ་སོགས་པའི་ཚོགས་ཀྱི་འཁོར་ལོའི་མཆོད་པ་དབུལ་བར་བྱའོ་
en: he should offer the gaṇacakra feast with wine and meat, with the teacher as the guest of honor.

source: ཤེས་རབ་ཀྱི་དབང་ངོ་
en: “This was the wisdom empowerment

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས། དབང་བསྐུར་བའི་རིམ་པར་ཕྱེ་བ་སྟེ་གསུམ་པའོ།། །།
en: This concludes the chapter on empowerments, the third in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: དེ་ནས་བཅོམ་ལྡན་འདས་མས་གསོལ་པ།
en: Then the goddess said:

source: ཇི་ལྟར་སྒོམ་པ་པོ་ཡི་ཕྱིར།
en: “How should he meditate,

source: ཁྲོ་ཆེན་གཏུམ་པོ་བསྒོམ་པར་བྱ། །
en: The meditator on Caṇḍa­mahā­roṣaṇa?

source: སྔགས་ཀྱི་བཟླས་པ་ཇི་ལྟར་བྱ། །
en: What mantra should he recite?

source: དབང་ཕྱུག་དམ་པ་བཤད་དུ་གསོལ། །
en: Please tell me, O great lord!”

source: ཡིད་དང་མཐུན་པའི་ས་ཕྱོགས་ནི། །
en: “In a place pleasing to the mind

source: བར་དུ་གཅོད་པ་ཀུན་བྲལ་བར། །
en: And free from all distractions,

source: དང་པོ་བྱམས་པ་བསྒོམ་པར་བྱ། །གཉིས་པར་སྙིང་རྗེ་བསྒོམ་པར་བྱ། །གསུམ་པ་ལ་ནི་དགའ་བ་བསྒོམ། །ཀུན་གྱི་མཐའ་ལ་བཏང་སྙོམས་སོ། །
en: One whose mind is in equipoise Should prepare a pleasant seat. “First one should cultivate loving kindness; Second, compassion; Third, sympathetic ‌joy; And, to complete the lot, ‌equanimity.

source: དེ་ནས་རང་གི་ཐུགས་ཀའི་ས་བོན་
en: “Then one should visualize the seed syllable in one’s heart,

source: པདྨ་དང་ཟླ་བ་དང་ཉི་མ་ལ་གནས་པའི་འོད་ཟེར་རྣམས་ཀྱིས་མདུན་དུ་བསམ་གཏན་གྱི་ཁྲོ་བོ་གཏུམ་པོ་བསམས་ནས་
en: Standing on the sun, which is on the moon, which is on the lotus. One should visualize Caṇḍa­mahā­roṣaṇa in front, Arisen from light rays of the seed syllable.

source: དེ་མདུན་སྡིག་པ་བཤགས་པར་བགྱི། །
en: In front of him, he should confess his sins

source: བསོད་ནམས་ལ་ཡང་རྗེས་ཡི་རང་། །
en: And rejoice in the virtues

source: གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བར་བྱ། །
en: “One should take the triple refuge,

source: བསོད་ནམས་ཡོངས་སུ་བསྔོ་བར་བྱ། །
en: One should dedicate the merit.

source: བྱང་ཆུབ་སེམས་ནི་བསྐྱེད་པར་བགྱི། །
en: And turn one’s mind to awakening.

source: འོད་ཟེར་རྣམས་ཀྱིས་སླར་ཡང་བསྡུ། །
en: And, again, absorb him with the rays of light.

source: སྔགས་འདི་ཉིད་ནི་བརྗོད་པར་བྱ། །
en: “Reciting the following mantra,

source: ཨོྃ་ཤཱུ་ནྱ་ཏཱ་ཛྙཱ་ན་བཛྲ་སྭ་བྷཱ་བ་ཨཱཏྨ་ཀོ྅ཧཾ།
en: Oṁ , I am of the nature of vajra, which is the wisdom of emptiness.

source: རབ་ཏུ་འབར་བས་ཧཱུྃ་ཡིག་ནི། འོད་ཟེར་དེ་ཡི་ཡ་བསྲེགས་པར་བསམ། །
en: “One should carefully visualize The syllable hūṁ burned by the light rays,

source: ག་བུར་བསྲེགས་པ་ཇི་བཞིན་བསམ། །
en: Then visualize it burning like camphor,

source: འོད་ཟེར་ལ་ཡང་རྣམ་མི་རྟོག །
en: And then one should not visualize even the light rays.

source: སྐད་ཅིག་གིས་ནི་རྣམ་པར་བསྒོམ། །
en: “Having visualized everything, for a short while,

source: ཐམས་ཅད་ནམ་མཁའ་ཇི་བཞིན་དུ། །
en: To be like space,

source: རང་ལུས་རྣམ་པར་བསྒོམ་པར་བྱ། །
en: One should visualize one’s own body

source: དྲི་མེད་དག་པའི་ཤེལ་བཞིན་དུ། །
en: To be translucent like a pure crystal.

source: སྔོན་དུ་བསྒོམ་བྱ་ཕྱི་ནས་ནི། ཡྃ་རྃ་བྃ་ལྃ་བཞི་རྣམས་ལས། །
en: “One after the other one should visualize Four syllables— yaṁ raṁ vaṁ laṁ

source: ཡོངས་གྱུར་བསྒོམ་བྱ་རླུང་དང་ནི། །མེ་དང་ཆུ་དངས་རྣམས་སོ། །
en: Transforming into, respectively, Wind, fire, water, and earth.

source: བྷྲུྃ་ཡིག་དེ་ལས་བསྒོམ་བྱ་བ། །
en: “Having then visualized the syllable bhruṁ

source: གཞལ་ཡས་ཁང་དུ་རབ་ཏུ་བསྒོམ། །
en: One should visualize the temple-palace

source: གྲུ་བཞི་པ་ལ་སྒོ་བཞི་པ།
en: That has four corners, four doors,

source: ཀ་བ་བརྒྱད་ཀྱིས་ཉེ་བར་མཛེས།
en: And is adorned with eight pillars.

source: དེ་ཡི་དབུས་སུ་བསམ་བྱ་བ། །
en: “One should visualize at its center

source: སྣ་ཚོགས་པདྨ་འདབ་བརྒྱད་ལྡན། །
en: A multicolored lotus with eight petals,

source: བྃ་ཡིག་ས་བོན་ལས་བྱུང་བ། །
en: Arisen from the seed syllable paṁ

source: དེ་ལ་ཨྃ་ཡིག་ལས་བྱུང་ཟླ། །
en: And on it, the moon, born from the syllable aṁ

source: རྃ་ཡིག་ལས་བྱུང་ཉི་མ་སྟེ། །
en: “On it again, the sun born from the syllable raṁ

source: དེ་སྟེང་ཧཱུྃ་ཡིག་ལས་ཀྱང་སླར། །
en: And above it the syllable hūṁ

source: ངེས་བསྐྱེད་ནི་བསྐྱོད་པ་རུ་བསམ། །མཱ་མ་ཀཱི་བཅས་ཡང་དག་སྦྱོར། །
en: One should visualize, born from this, Akṣobhya in union with Māmakī.

source: དེ་ལ་རིམ་བཞིན་རྣལ་འབྱོར་དབང་། །དེ་ཡི་སྤྱི་བོ་ལ་ཐིམ་ནས། །
en: “The lord of yogins should enter there, Through the crown aperture of Akṣobhya,

source: སྐར་མདའ་ཇི་བཞིན་སྦྱོར་བ་ཡིས། །
en: By the method of a shooting star,

source: མཱ་མ་ཀཱི་ཡི་བྷ་གར་བསམ།
en: Intent on the bhaga of Māmakī.

source: དེ་ལས་ཁུ་བ་རོ་མཉམ་གྱུར། །
en: “Having then become the essence of semen,

source: ལྷུང་གྱུར་དེ་ཡི་བྷ་གའི་ནང་། །
en: He should fall inside her bhaga.

source: གཏུམ་པོའི་གཟུགས་སུ་གྱུར་ནས་ནི། །བྷ་གའི་མཐའ་ལས་ངས་བྱུང་ནས། །
en: he should subsequently emerge from there In the complete form of Caṇḍa­mahā­roṣaṇa.

source: མི་བསྐྱོད་པ་ལ་རལ་གྲི་ཡིས། །བསྣུན་ནས་ཕྱི་ནས་རབ་ཏུ་བཟའ། །
en: “One should kill Akṣobhya, the father, With the sword, and later eat him.

source: མཱ་མ་ཀཱིས་ཀྱང་དེ་ལས་དེའི། །ཤ་ཟ་བར་ནི་རབ་ཏུ་བསམ། །
en: One should then visualize him Being eaten also by Māmakī.

source: དེ་ཕྱིར་མཱ་མ་ཀཱིས་བཟུང་ནས། །མ་དང་ཡང་དག་རབ་འདོད་བྱ། །
en: “Then, having seized Māmakī, the mother, One should make love to her.

source: དེས་ཀྱང་འཁྱུད་པར་བསམ་བྱ་བ། །
en: One should visualize oneself embraced by her,

source: ཞེ་སྡང་རྡོ་རྗེ་མ་ཡི་གཟུགས། །
en: In her form of Hatred Vajrī.

source: གཡོན་པ་ཞགས་པ་དང་བཅས་པའི། །
en: His left is holding a noose;

source: སྡིགས་མཛུབ་ཀྱིས་ནི་སྡིགས་པར་བྱེད། །
en: He is making a threatening gesture with his index finger,

source: སོ་ཡིས་མ་མཆུ་ཡང་དག་བསྡམས། །
en: And bites his lower lip with his fangs.

source: རྐང་གཡས་བརྡེགས་པའི་སྟབས་ཀྱིས་ནི། །
en: “Kicking with his right foot,

source: བདུད་བཞི་རྣམ་པར་ཉེད་པར་མཛད། །
en: He is smashing the four Māras.

source: པུས་མོ་གཡོན་པས་ལ་བཙུགས། །
en: His left knee is on the ground.

source: འཇིགས་བྱེད་འཁྱོག་པོར་གཟིགས་པ་ཅན། །
en: Squint eyed, he inspires fear.

source: ནོར་འཛིན་ལ་ནི་སྡིགས་མཛུབ་བསྟན། །
en: “He points a threatening gesture at Vasudhā,

source: པུས་མོ་གཡོན་པའི་རྩེ་མོས་གནས། །
en: Kneeling on the cap of his left knee.

source: མི་བསྐྱོད་སྔོན་པོས་དབུ་རྒྱན་མཛད། །རིན་པོ་ཆེ་ཡི་ཅོད་པན་ཅན། །
en: He has Akṣobhya for his crest jewel; He is of blue color and wears a jewel diadem.

source: རྒྱན་རྣམས་ཀུན་གྱིས་བརྒྱན་གྱུར་པའི། །གཞོན་ནུ་ཟུར་ཕུད་ལྔ་དང་ལྡན། །
en: “A princely youth, Wearing Five Braids of Hair, Adorned with all the ornaments,

source: བརྒྱད་གཉིས་ལོ་ཡི་རྣམ་པ་ཅན། །
en: He appears to be sixteen years old,

source: སྤྱན་གཉིས་དམར་པོ་གཙོ་བོ་ཡི། །
en: And his eyes are red

source: སེམས་ཉིད་བརྟན་པར་བསྒོམ་པར་བྱ། །
en: “One should meditate with a steadfast mind:

source: དེ་ནས་སྲུབ་པའི་སྦྱོར་བ་ཡིས། །
en: Then, by a churning method,

source: ཤར་དུ་མི་གཡོ་དཀར་པོ་སྤྲོ། །
en: One should emanate White Acala in the east.

source: མེ་མཚམས་གཏི་མུག་རྡོ་རྗེ་མ། །སྟོན་ཀའི་ཟླ་འོད་དང་མཚུངས་སྤྲོ། །
en: “One should emanate Delusion Vajrī in the southeast, Of the color of autumnal white lotus.

source: ལྷོ་རུ་མི་གཡོ་སེར་པོ་སྤྲོ། །
en: One should emanate Yellow Acala in the south,

source: ཕྲ་མ་རྡོ་རྗེ་བདེན་བྲལ་སེར། །
en: And Calumny Vajrī in the southwest.

source: མི་གཡོ་དམར་པོ་ནུབ་ཏུ་སྤྲོ། །
en: “One should emanate Red Acala in the west,

source: རླུང་དུ་འདོད་ཆགས་རྡོ་རྗེ་མ། །
en: And the red Passion Vajrī in the northwest.

source: མི་གཡོ་ལྗང་ཁུ་བྱང་ཕྱོགས་སུ། །
en: In the north, one should emanate Green Acala,

source: དབང་ལྡན་ཕྲག་དོག་རྡོ་རྗེ་མ། །
en: And in the northwest, green Envy Vajrī.

source: རང་གི་མགྲིན་པ་ལས་བྱུང་བའི། །ལྷ་མོ་རྣམས་ཀྱིས་གླུ་ཡིས་བསྐུལ། །
en: these goddesses rouse the lord With songs coming from their own throats.

source: གཏི་མུག་རྡོ་རྗེ་མས་སོ། །
en: “From Delusion Vajrī:

source: པ་ཧུ་མེེ་ཏྲཱི་དུ་བི་བརྫྫི་ཨ་ཧོ་མཱ་ཤུནྣ་ས་ཧཱ་པ་ཏོཛྫུ་བཱི་ཨོ་ཨེ་ཕིཊྚ་མི་སབྦ་ཛ། ག་ཧི་བ་བྷཱ་བ།
en: “ ‘Lord, do not abandon loving kindness And do not become void by nature! If separated from you, I will perish, And so will all beings—each and every one of them.’

source: ཁྱབ་བདག་བྱམས་པ་རྣམ་སྤངས་ནས། །སྟོད་པའི་རང་བཞིན་དུ་མ་མཛད། །
en: “ ‘Lord, do not abandon loving kindness

source: ཁྱོད་དང་རྣམ་བྲལ་བདག་འགུམ་པས། །
en: If separated from you, I will perish,

source: ཕྲ་མ་རྡོ་རྗེ་མ་ཡིས་སོ།
en: “From Calumny Vajrī:

source: མཱ་ཀ་རུ་ཎཱ་ཅི་ཨ་ཕིཊྚ་ཧི་པ་ཧུ་མཱ་ཧོ་ཧི་ཏུ་ཤུནྣ་མཱ་མོ་ཛྫུ་དེ་ཧ། སུ་དུཀྑི་ཨ་ཧུ་ཨི་ཛཱི་བ་བི་ཧུནྣཿ།
en: “ ‘Do not abandon the mind of compassion! O lord, do not become void, Lest my suffering body Becomes devoid of life!’

source: ཁྱབ་བདག་སྟོང་པར་མ་མཛད་ཅིག །
en: O lord, do not become void,

source: བདག་གི་ལུས་ནི་སྡུག་བསྔལ་བས། །འཚོ་བ་དང་བྲལ་མ་མཛད་ཅིག །
en: Lest my suffering body

source: འདོད་ཆགས་རྡོ་རྗེ་མའི་འོ། །
en: “From Passion Vajrī:

source: ཀཱི་ས་ཏུ་ཧ་རི་ས་བི་ཧོ་ཧི་ཨ་ཤུནྣ་ཧི་ཀ་ར་སི་པ་བེ་ཤ། ཏོཛྫུ་ནི་མནྟཱ་ཎ་ཀ་རི་ཨ་མ་ཎྞི་ཨཙྪ་ཨི་ལོ་ཨཱ་ཤི་ཥ།
en: “ ‘Why, O virtuous one, should you abandon sympathetic ‌joy And enter the void? You have made a promise! The entire world rests in your heart.’

source: དགའ་བ་སྤངས་ནས་སྟོང་པར་འཇུག །
en: should you abandon sympathetic ‌joy

source: འཇིག་རྟེན་མ་ལུས་པ་རྣམས་དང་། །བདག་གི་ཡིད་ནི་ཁྱོད་ལ་སྡོད། །
en: The entire world rests in your heart.’

source: ཕྲག་དོག་རྡོ་རྗེ་མའིའོ། །
en: “From Envy Vajrī:

source: ཛོ་བ་ན་མཙྪི་ཨུ་པ་ཁི་ཨ་ནིཥྤ་ལ་ཤུནྣཿ། ཨ་ཌིཊྚེ། ཤུནྣ་ས་ཧཱ་བ་བི་གོ་ཨི་ཨ་ཀ་ར་ཧི་ཏུ་མོ་ཨེཾེ་ས་མ་གྷིཊྚི།
en: “ ‘If you consider me, youthful as I am, The view of the void is fruitless. Abandon the nature of void! Please make love to me!’

source: སྟོང་པའི་རང་བཞིན་ཉིད་སྤོངས་ལ། །
en: Abandon the nature of void!

source: བདག་ལ་མཉམ་ཉིད་སྦྱོར་བར་མཛོད། །
en: Please make love to me!’

source: འདི་ནི་རྨི་ལམ་ལྟར་ཐོས་ནས། །
en: “Having heard these four songs as if in a dream,

source: སྔོན་མའི་གཟུགས་བཞིན་བསམ་པར་བྱ། །
en: One should visualize him in his exact previous form,

source: མི་གཡོ་དཀར་པོ་ལ་བསྣུན་ནས། །
en: “Then, having killed White Acala,

source: གཏི་མུག་རྡོ་རྗེར་རབ་འདོད་བྱ། །
en: One should make love to Delusion Vajrī.

source: མི་གཡོ་དཀར་པོའི་གཟུགས་སུ་བྱ། །
en: Assuming the form of White Acala,

source: མི་གཡོ་སེར་པོ་སླར་བསད་ནས། །
en: One should, in turn, kill Yellow Acala.

source: འདོད་བྱ་ཕྲ་མ་རྡོ་རྗེ་མར། །
en: “One should make love to Calumny Vajrī,

source: བདག་ཉིད་མི་གཡོ་སེར་པོར་བྱ། །
en: Oneself having turned into Yellow Acala.

source: དེ་བཞིན་མི་གཡོ་དམར་པོ་བསད། །
en: Having, in the same way, killed Red Acala,

source: འདོད་ཆགས་རྡོ་རྗེ་མར་འདོད་བྱ། །
en: One should make love to Passion Vajrī.

source: མི་གཡོ་དམར་པོར་བདག་ཉིད་བྱ། །
en: “Having turned into Red Acala,

source: མི་གཡོ་ལྗང་ཁུས་བསད་ནས་ཀྱང་། །
en: One should, in turn, kill Green Acala.

source: ཕྲག་དོག་རྡོ་རྗེ་མར་འདོད་བྱ། །
en: One should then make love to Envy Vajrī,

source: མི་གཡོ་ལྗང་ཁུར་བདག་ཉིད་བྱ། །
en: Having oneself turned into Green Acala.

source: ལྷ་མོ་བཞི་ལ་རྗེས་ཆགས་པས། །
en: “Having impassioned the four goddesses,

source: དཀྱིལ་འཁོར་ཐམས་ཅད་ཡང་དག་བསྡུ།
en: One should absorb the entire maṇḍala.

source: བདག་ཉིད་གཅིག་ཏུ་ཡང་དག་སྦྱོར། །འབད་པ་ཡིས་ནི་བསྒོམ་པར་བྱ།
en: The devotee should ardently visualize Just oneself, embraced.

source: བདག་ལ་དངོས་གྲུབ་ཐེ་ཚོམ་མེད། །
en: ‘I am an accomplished one without any doubt.’

source: ཁ་དོག་ནག་ཕྱིར་རྣལ་འབྱོར་པ། །གང་བསྒོམ་དེ་ནི་མི་གཡོ་ནག །
en: A yogin of black complexion Should meditate on Black Acala.

source: ཁ་དོག་དཀར་ཕྱིར་རྣལ་འབྱོར་བ། །གང་བསྒོམ་དེ་ནི་མི་གཡོ་དཀར། །
en: “A yogin of white complexion Should meditate on White Acala.

source: ཁ་དོག་སེར་ཕྱིར་རྣལ་འབྱོར་པ། །གང་བསྒོམ་དེ་ནི་མི་གཡོ་སེར། །
en: A yogin of yellow complexion Should meditate on Yellow Acala.

source: ཁ་དོག་དམར་ཕྱིར་རྣལ་འབྱོར་པ། །གང་བསྒོམ་དེ་ནི་མི་གཡོ་དམར། །
en: “A yogin of red complexion Should meditate on Red Acala.

source: ཁ་དོག་ལྗང་ཕྱིར་རྣལ་འབྱོར་པ། །གང་བསྒོམ་དེ་ནི་མི་གཡོ་ལྗང་། །
en: A yogin of green complexion Should meditate on Green Acala.

source: ཁ་དོག་ནག་མོའི་བུད་མེད་དེས། །
en: “A woman who is of black complexion

source: ཞེ་སྡང་རྡོ་རྗེ་མ་བསྒོམ་བྱ། །
en: Should meditate on Hatred Vajrī.

source: ཁ་དོག་དཀར་མོའི་བུད་མེད་དེས། །
en: A woman who is of white complexion

source: གཏི་མུག་རྡོ་རྗེ་མ་བསྒོམ་བྱ། །
en: Should meditate on Delusion Vajrī.

source: ཁ་དོག་སེར་མོའི་བུད་མེད་དེས། །
en: “A woman who is of yellow complexion

source: ཕྲ་མ་རྡོ་རྗེ་མ་བསྒོམ་བྱ། །
en: Should meditate on Calumny Vajrī.

source: ཁ་དོག་དམར་མོའི་བུད་མེད་དེས། །
en: A woman who is of red complexion

source: འདོད་ཆགས་རྡོ་རྗེ་མ་བསྒོམ་བྱ། །
en: Should meditate on Passion Vajrī.

source: ཁ་དོག་ལྗང་ཁུའི་བུད་མེད་དེས།
en: “A woman who is of green complexion

source: ཕྲག་དོག་རྡོ་རྗེ་མ་བསྒོམ་བྱ། །
en: Should meditate on Envy Vajrī.

source: སྐྱེས་ཀུན་རྡོ་རྗེའི་རྣལ་འབྱོར་བ། །
en: Every man is a vajra yogin,

source: བུད་མེད་རྡོ་རྗེའི་རྣལ་འབྱོར་མ། །
en: And every woman is a vajra yoginī.

source: འདི་རྣམས་ཀུན་ལ་རབ་ཏུ་བརྟག །
en: “One should do all these assignations

source: ནག་སོགས་ཁ་དོག་དབྱེ་བ་ཡིས། །
en: According to the division of colors—the black and so forth.

source: ཡང་ན་ལས་ཀྱི་དབྱེ་བ་ཡིས། །
en: Alternatively, following the division of the types of action,

source: དབྱེ་བ་ལྔ་རུ་རབ་ཏུ་བརྟག །
en: There would be the fivefold assignation as follows:

source: གནག་ཕྱིར་གསད་དང་ཞེ་སྡང་ལ། །
en: “Black color is for killing and hatred;

source: རེངས་དང་རྒྱས་ལ་སེར་པོ་སྟེ། །
en: Yellow is for paralyzing and enriching;

source: དབང་དང་དགུག་ལ་དམར་པོའོ། །
en: Red is for enthralling and attracting.

source: སྐྲོད་པ་ལས་ནི་ལྗང་ཁུར་བཤད། །
en: “Dark green is said to be for expelling.

source: ཡང་ན་རིགས་ཀྱི་རབ་དབྱེ་བས། །
en: As for the division corresponding to one’s caste,

source: བྲམ་ཟེ་དཀར་པོ་
en: the brahmin is white,

source: གཏུམ་པོ་སེར་པོ་དག་ལ་འདོད། །
en: the butcher is known to be yellow.

source: དམར་པོ་གར་མ་དག་ལ་འདོད། །
en: “The dancer is red,

source: བུ་མོ་སྔོ་བསངས་མིག་ཡངས་མ། །ནག་པོ་བསྒོམ་པ་པོས་འདོད་བྱ། །
en: One of black nature should make love To a black girl with elongated eyes.

source: བུ་མོ་དཀར་པོ་དཀར་མོ་ཡིས། །
en: “One of white nature should make love to a white girl;

source: བུ་མོ་སེར་པོ་སེར་མོ་ཡིས། །
en: One of distinctly yellow nature, to a yellow girl.

source: བུ་མོ་དམར་པོ་དམར་མོ་ཡིས། །
en: One of red nature should make love to a red girl;

source: བུ་མོ་ལྗང་ཁུ་ལྗང་ཁུ་ཡིས། །
en: One of green nature, for his part, to a green girl.

source: ཡང་ན་གང་གིས་དེ་འཛིན་པ། །དེ་དང་དེ་ཡི་བསྒོམ་པ་མཆོག
en: “Or else, whatever girl one finds, Engaged in meditation according to that,

source: ཇི་ལྟ་བ་ཡང་མི་ཤེས་པས། །སེམས་ཉིད་བརྟན་པས་འདོད་པར་བྱ། །
en: One should make love to her with a steadfast mind, In such a way that nobody knows.

source: བུ་མོ་དེ་ཡིས་དངོས་གྲུབ་སྟེར། །
en: “They are girls who can grant true accomplishment

source: རྡོ་རྗེའི་ཤུ་ཀྲར་གྱུར་པ་ལ། །ལྕེ་ཡིས་ཀུན་ནས་འཇིབ་པར་བྱ། །
en: Their sexual fluid is vajra— One should lick it all with one’s tongue.

source: ཇི་སྲིད་འདོད་པའི་བཤང་གཅི་ཡང་།
en: “One should drink their urine as one pleases,

source: དེ་ཡི་ཁ་དང་བྷ་གར་སྦྱིན། །
en: Placing one’s face on their bhaga.

source: གུ་ད་པདྨ་རབ་འཇིབ་པས། །
en: Or, indeed, placing the face on the lotus of their anus,

source: བོཥྛྃ་ཅི་འདོད་རབ་བཟའ་བྱ། །
en: One should eat, as one pleases, their feces.

source: ངོ་ཚ་སྐྱུག་བྲོ་བྱེད་གྱུར་ན། །རྣམ་པ་ཀུན་དུ་དངོས་གྲུབ་ཉམས། །
en: “One must not feel any disgust, not even a little, Otherwise one will lose one’s accomplishment.

source: འདི་ནི་རང་གི་བཟའ་བ་མཆོག །སངས་རྒྱས་ཀུན་གྱིས་རབ་ཏུ་བཟས།
en: This private food is the best, Eaten by all the buddhas.”

source: དཔའ་བོ་གཅིག་པུར་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས། ལྷ་ཉིད་ཀྱི་རིམ་པར་ཕྱེ་བ་སྟེ་བཞི་པའོ།། །།
en: This concludes the deity chapter, the fourth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: དེ་ནས་སྔགས་རྣམས་ཀུན་ལས་བཏུས། །བདག་གིས་རབ་ཏུ་བཤད་པར་བགྱི། །
en: “Now I will teach the complete collection of mantras.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བདུད་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་བཞུགས་ནས།
en: So saying, the lord entered the absorption called Victory over All Māras,

source: སྔགས་ཀུན་ལས་བཏུས་པ་འདི་གསུངས་སོ། །
en: and presented the collection of mantras.

source: རྩ་བའི་སྔགས་སོ།
en: “The root mantra:

source: ཨོྃ་ཙཎྜ་མ་ཧཱ་རོ་ཥ་ཎ་ཧཱུྃ་ཕཊ།
en: Oṁ , Caṇḍa­mahā­roṣaṇa, hūṁ phaṭ

source: རྩ་བའི་སྔགས་གཉིས་པའོ།
en: The second root mantra:

source: རྩ་བའི་སྔགས་གསུམ་པའོ། །
en: The third root mantra:

source: ཨོྃ་ཧཱུྃ་ཕཊ། །
en: Oṁ hūṁ phaṭ

source: ཧཱུྃ་སྙིང་པོའི་སྔགས་སོ། །
en: The heart mantra: Hūṁ

source: ཧཱྃ་སྙིང་པོའི་སྔགས་གཉིས་པའོ།
en: The second heart mantra: Āṁ

source: ཧྲིཾ་སྙིང་པོའི་སྔགས་གསུམ་པའོ།
en: The third heart mantra: Haṁ

source: ཕྲེང་བའི་སྔགས་སོ།
en: “The garland mantra:

source: ཨོྃ་ཧྲཱྃ་ཧྲཱྃ་ཧྲྃ།
en: Oṁ hrāṁ hrīṁ hrauṁ

source: ཙཎྜ་ཙ་ཊ་ཙ་ཊ། པྲ་ཙ་ཊ་པྲ་ཙ་ཊ།
en: in your fierce form, expel, expel!

source: ཕྲེང་བའི་སྔགས་གཉིས་པའོ།
en: “The second garland mantra:

source: ཕྲེང་བའི་སྔགས་གསུམ་པའོ། །
en: “The third garland mantra:

source: ཞེས་པ་ནི་མི་གཡོ་བ་ལྔ་པོ་རྣམས་ཀྱི་སྤྱིའི་སྔགས་སོ། །
en: “These were the mantras common to the five Acalas.

source: བྱེ་བྲག་པའི་སྔགས་ནི།
en: There are, however, mantras specific to each of them:

source: ཨོྃ་ཀྲྀཥྞཱ་ཙ་ལ་ཧཱུྃ་ཕཊ།
en: Oṁ , Black Acala, hūṁ , phaṭ

source: ཨོཾ་ཤྭེ་དྭ་ཙ་ལ་ཧཱུྃ་ཕཊ།
en: Oṁ , White Acala, hūṁ , phaṭ

source: ཨོྃ་པཱི་ཏཱ་ཙ་ལ་ཧཱུྃ་ཕཊ།
en: Oṁ , Yellow Acala, hūṁ , phaṭ

source: ཨོྃ་རཀྟཱ་ཙ་ལ་ཧཱུྃ་ཕཊ།
en: Oṁ , Red Acala, hūṁ , phaṭ

source: ཨོྃ་ཤྱཱ་མཱ་ཙ་ལ་ཧཱུྃ་ཕཊ།
en: Oṁ , Green Acala, hūṁ , phaṭ

source: ལྷ་མོ་རྣམས་ཀྱི་ཐུན་མོང་བའི་སྔགས་ནི།
en: “There are also mantras common to the goddesses:

source: ཨོྃ་བཛྲ་ཡོ་གི་ནི་ཧཱུྃ་ཕཊ།
en: Oṁ , Vajrayoginī, hūṁ , phaṭ

source: རྩ་བའི་སྔགས་གཉིས་པའོ། །
en: The second root mantra:

source: ཨོྃ་པྲཛྙཱ་པཱ་ར་མི་ཏེ་ཧཱུྃ་ཕཊ།
en: Oṁ , Prajñāpāramitā, hūṁ , phaṭ

source: རྩ་བའི་སྔགས་གསུམ་པའོ།
en: The third root mantra:

source: ཨོྃ་བོོ་ཧི་རཾ་ཧཱུྃ་ཕཊ།
en: Oṁ , Vauherī, hūṁ , phaṭ

source: ཨོྃ་པི་ཙུ་པི་ཙུ་པྲཛྙཱ་བརྡྷ་ནི། ཛྭ་ལ་ཛྭ་ལ་མེདྷཱ་བརྡྷ་ནི། དྷི་རི་དྷི་རི་བུདྡྷི་བརྡྷ་ནི་སྭཱ་ཧཱ།
en: Oṁ , picu , picu ! Increaser of wisdom, burn, burn! Increaser of knowledge, dhiri , dhiri ! Increaser of intelligence, svāhā

source: ཨོཾ་དྭེ་ཥ་བཛྲི་ཧཱུྃ་ཕཊ།
en: Oṁ , Hatred Vajrī, hūṁ , phaṭ

source: ཨོཾ་མོ་ཧ་བཛྲི་ཧཱུྃ་ཕཊ།
en: Oṁ , Delusion Vajrī, hūṁ , phaṭ

source: ཨོྃ་པི་ཤུན་བཛྲི་ཧཱུྃ་ཕཊ།
en: Oṁ , Calumny Vajrī, hūṁ , phaṭ

source: ཨོྃ་རཱ་ག་བཛྲི་ཧཱུྃ་ཕཊ།
en: Oṁ , Passion Vajrī, hūṁ , phaṭ

source: ཨོྃ་ཨཱིཪྵྱ་བཛྲི་ཧཱུྃ་ཕཊ། །
en: Oṁ , Envy Vajrī, hūṁ , phaṭ

source: གཏོར་མའི་སྤྱི་སྔགས་ནི།
en: “This is the common mantra of the oblation offering:
